---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
VectorAtPoint..::..SetFlags Method
VectorAtPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetFlags(IList<(Of <<'(Int32>)>>)) | Independently sets the flags associated to all measurements.  (Inherited from ValueAtPointBase.) |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value.  (Inherited from ValueAtPointBase.) |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement.  (Inherited from ValueAtPointBase.) |

# See Also

VectorAtPoint Class

VectorAtPoint Members

Autodesk.Revit.DB.Analysis Namespace